const { sum } = require('./math');
// const sum = require('./math');

const test = require('./test');

console.log(4);

console.log(sum(2, 2));
/*
  1. resolving - пошук файла / пакета
    1.1 під'єднуються модулі ядра ноди
    1.2 шукаємо файл
      1.2.1 з розширенням .js
      1.2.2 з розширенням .json
    1.3 шукаємо папку
      1.3.1 шукають package.json і в ньому властивість "main"
      1.3.2 шукається файл з назвою index.js || index.json
    1.4 шукає такий пакет в node_modules
    1.5 кидаємо помилку 
  2. read - файл читається
  3. wrapping - файл обгортається у функцію, в яку також додають ін'єктовані дані
  4. evaluation - функція з п.3 запускається
  5. caching - результати запуску зберігаються. При чому для кожного файла п.4 виконуєтсья тількі один раз. Збережені результати віддаються при імпорті

*/